JayHeng/imxrt-tool-flash-algo/devices/MIMXRT685S/drivers/fsl_casper.c
/*
 * Copyright 2018-2019 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_casper.h"
#include <math.h> /* ceil TODO check if really need it */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/* Component ID definition, used by tools. */
#ifndef FSL_COMPONENT_ID
#define FSL_COMPONENT_ID "platform.drivers.casper"
#endif

#if defined(__GNUC__)
/* Enforce O1 optimize level, specifically to remove strict-aliasing option.
  (-fno-strict-aliasing is required for this driver). */
#pragma GCC push_options
#pragma GCC optimize("-O1")
#endif

#define CASPER_RAM_BASE_NS (FSL_FEATURE_CASPER_RAM_BASE_ADDRESS)

#if defined(FSL_FEATURE_CASPER_RAM_IS_INTERLEAVED) && FSL_FEATURE_CASPER_RAM_IS_INTERLEAVED
#define CASPER_RAM_OFFSET (0xE)
#define INTERLEAVE(addr)                                                                                             \
    (((((((addr) >> 2) & 0x00000001) << CASPER_RAM_OFFSET) + (((addr) >> 3) << 2) + ((addr)&0x00000003)) & 0xFFFF) | \
     s_casperRamBase)
#define DEINTERLEAVE(addr) INTERLEAVE(addr)
#define GET_WORD(addr) (*((uint32_t *)DEINTERLEAVE((uint32_t)(addr))))
#define GET_DWORD(addr) (((uint64_t)GET_WORD(addr)) | (((uint64_t)GET_WORD(((uint32_t)(addr)) + 4)) << 32))
#define SET_WORD(addr, value) *((uint32_t *)INTERLEAVE((uint32_t)(addr))) = ((uint32_t)(value))
#define SET_DWORD(addr, value)                                                            \
    do                                                                                    \
    {                                                                                     \
        SET_WORD(addr, (uint32_t)(value & 0xFFFFFFFF));                                   \
        SET_WORD(((uint32_t)(addr)) + 4, (uint32_t)((value & 0xFFFFFFFF00000000) >> 32)); \
    } while (0)

/* memcopy is always word aligned */
/* interleaved to interleaved
  static void CASPER_MEMCPY_I2I(void *dst, const void *src, size_t siz)
 */
#define CASPER_MEMCPY_I2I(dst, src, siz)                             \
    \
{                                                             \
        uint32_t *dst32 = (uint32_t *)dst, *src32 = (uint32_t *)src; \
        int i;                                                       \
        for (i = 0; i < siz / 4; i++)                                \
        {                                                            \
            SET_WORD(&dst32[i], GET_WORD(&src32[i]));                \
        }                                                            \
    \
}

/* interleaved to non-interleaved
   static void CASPER_MEMCPY_I2N(void *dst, const void *src, size_t siz)
 */
#define CASPER_MEMCPY_I2N(dst, src, siz)                             \
    \
{                                                             \
        uint32_t *dst32 = (uint32_t *)dst, *src32 = (uint32_t *)src; \
        int i;                                                       \
        for (i = 0; i < siz / 4; i++)                                \
        {                                                            \
            dst32[i] = GET_WORD(&src32[i]);                          \
        }                                                            \
    \
}

/* non-interleaved to interleaved
   static void CASPER_MEMCPY_N2I(void *dst, const void *src, size_t siz)
 */
#define CASPER_MEMCPY_N2I(dst, src, siz)                                      \
    \
{                                                                      \
        volatile uint32_t *dst32 = (uint32_t *)dst, *src32 = (uint32_t *)src; \
        volatile int i;                                                       \
        for (i = 0; i < siz / 4; i++)                                         \
        {                                                                     \
            SET_WORD(&dst32[i], src32[i]);                                    \
        }                                                                     \
    \
}
#else
#define GET_WORD(addr) (*((uint32_t *)(addr)))
#define GET_DWORD(addr) (*((uint64_t *)(addr)))
#define SET_WORD(addr, value) *((uint32_t *)(addr)) = ((uint32_t)(value))
#define SET_DWORD(addr, value) *((uint64_t *)(addr)) = ((uint64_t)(value))

#define CASPER_MEMCPY_I2I(dst, src, siz) memcpy(dst, src, siz)
#define CASPER_MEMCPY_I2N(dst, src, siz) memcpy(dst, src, siz)
#define CASPER_MEMCPY_N2I(dst, src, siz) memcpy(dst, src, siz)
#endif

#define WORK_BUFF_MUL4 (N_wordlen_max * 4 + 2) /* ! working buffer is 4xN_wordlen to allow in place math */
#define N_bytelen (N_wordlen * 4)              /*  for memory copy and the like */
#define N_dwordlen (N_wordlen / 2)

#define PreZeroW(i, w_out)             \
    for (i = 0; i < N_wordlen; i += 4) \
    {                                  \
        SET_WORD(&w_out[i + 0], 0);    \
        SET_WORD(&w_out[i + 1], 0);    \
        SET_WORD(&w_out[i + 2], 0);    \
        SET_WORD(&w_out[i + 3], 0);    \
    } /*  unrolled partly */
#define PreZeroW2up(i, w_out)                       \
    for (i = N_wordlen; i <= N_wordlen * 2; i += 4) \
    {                                               \
        SET_WORD(&w_out[i + 0], 0);                 \
        SET_WORD(&w_out[i + 1], 0);                 \
        SET_WORD(&w_out[i + 2], 0);                 \
        SET_WORD(&w_out[i + 3], 0);                 \
    } /*  unrolled partly */

/* Macros for the ECC component in Casper */

/* CASPER memory layout for ECC */
#define CASPER_NUM_LIMBS (NUM_LIMBS + 4) // number of limbs needed by CASPER is 2 double words longer

#define CASPER_MEM ((uint32_t *)msg_ret)
#define CASPER_OFFSET CASPER_NUM_LIMBS // offset in the CASPER memory where we can start writing

#define MOD_SCRATCH_START (CASPER_OFFSET)
#define MOD_SCRATCH_SIZE (1 * CASPER_NUM_LIMBS)

#define INOUT_SCRATCH_START (MOD_SCRATCH_START + MOD_SCRATCH_SIZE)
#define INOUT_SCRATCH_SIZE ((3 * 3) * CASPER_NUM_LIMBS)

#define ECC_SCRATCH_START (INOUT_SCRATCH_START + INOUT_SCRATCH_SIZE)
#define ECC_SCRATCH_SIZE (9 * CASPER_NUM_LIMBS)

#define LUT_SCRATCH_START (ECC_SCRATCH_START + ECC_SCRATCH_SIZE)
#define LUT_SCRATCH_SIZE (48 * NUM_LIMBS + 3 * CASPER_NUM_LIMBS)

/* Currently these macros work on 32-bit platforms  */

#define add(c1, c0, a, b) \
    \
do                 \
    {                     \
        uint32_t _t;      \
        _t = a + b;       \
        c1 = (_t < a);    \
        c0 = _t;          \
    \
}                  \
    while (0)

